In [2]:
# import libraries
import pandas as pd

# convert txt files into csv files, keep original txt files
for year in range (1880,2022):
    y = str(year)
    names_file = pd.read_csv("/Users/nicolegololobov/Documents/Programs/Names2021/yob_txt/yob" + y + ".txt", header=None)
    names_file.to_csv("/Users/nicolegololobov/Documents/Programs/Names2021/yob_csv/yob" + y + ".csv", index = None)

In [62]:
# import libraries
import pandas as pd

# read data into pandas dataframe
names = pd.read_csv("/Users/nicolegololobov/Documents/Programs/Names2021/yob_csv/yob1880.csv")

# rename columns in df
names.columns.values[0] = "Name"
names.columns.values[1] = "Gender"
names.columns.values[2] = "Quantity"

# add column for year
names['Year'] = "1880"

# add data from the other files to df
for year in range (1881,2022):
    y = str(year)
    file = "/Users/nicolegololobov/Documents/Programs/Names2021/yob_csv/yob" + y + ".csv"
    names2 = pd.read_csv(file)
    names2.columns.values[0] = "Name"
    names2.columns.values[1] = "Gender"
    names2.columns.values[2] = "Quantity"
    names2['Year'] = y 
    names = pd.concat([names, names2], axis=0)

In [16]:
# see last five rows of df
names.tail()

         Name Gender  Quantity  Year
31532  Zyeire      M         5  2021
31533    Zyel      M         5  2021
31534   Zyian      M         5  2021
31535   Zylar      M         5  2021
31536     Zyn      M         5  2021

In [90]:
# return csv file that lists unique names
first_names = names.groupby('Name', as_index=True).first()
first_names.to_csv("/Users/nicolegololobov/Documents/Programs/Names2021/first_names.csv")

In [91]:
# return csv file that lists unique names by highest quantity
first_names2 = names.sort_values('Quantity', ascending=False).drop_duplicates(['Name'])
first_names2.to_csv("/Users/nicolegololobov/Documents/Programs/Names2021/first_names2.csv")

In [17]:
# count rows in df
# 2,052,781 rows
names.shape[0]

2052781

In [40]:
# count how many unique names are in df
# 101,338 total
names["Name"].nunique()

101338

In [ ]:
# return rows where quantity is greater than 100
names_quantity = names[names['Quantity'] > 100]

In [104]:
# return rows that contain a certain name
names_name = names[names.Name == 'Honoka']
names_name

         Name Gender  Quantity  Year
14825  Honoka      F         6  2004
18185  Honoka      F         5  2006
11086  Honoka      F        10  2008
17182  Honoka      F         5  2016
16783  Honoka      F         5  2017
12929  Honoka      F         7  2019
16053  Honoka      F         5  2021

In [32]:
# return names unique to year 2021 (only works for last year of df)

# print rows of unique names, keep first example
names_uniq = names.drop_duplicates('Name', keep='first')

# print rows for a certain year
names_uniq2021 = names_uniq[names_uniq.Year == '2021']
names_uniq2021

            Name Gender  Quantity  Year
3578     Namaari      F        43  2021
4042    Parklynn      F        36  2021
4126      Sayori      F        35  2021
4944   Arianelly      F        26  2021
5499       Sanem      F        23  2021
...          ...    ...       ...   ...
31507      Zayre      M         5  2021
31512     Zehaan      M         5  2021
31515     Zeland      M         5  2021
31516   Zemariam      M         5  2021
31525      Zhayd      M         5  2021

[938 rows x 4 columns]

In [41]:
# compare total born in df vs in reality

# return rows for a certain year
names_year = names[names.Year == '2021']
names_year
print(names_year['Quantity'].sum())

# 3,361,375 in df / 3,659,289 total estimated = 91.86%

3361375

In [97]:
# value counts for quantities
names_by_q = names.sort_values('Quantity', ascending=False).drop_duplicates(['Name'])
names_by_q["Quantity"].value_counts()

5        19262
6        12632
7         8864
8         6834
9         5339
         ...
1133         1
1134         1
1135         1
1138         1
99693        1
Name: Quantity, Length: 2352, dtype: int64

In [ ]:
# return rows with longest names
names_length=names[names["Name"].apply(lambda x: len(x) > 14)]
names_length

In [102]:
# for each unique name, count total quantity across all years
# rank by year for each gender
# return rows with multiple conditions
# biggest spikes or dips in popularity